
def area(a):

#   ```
#   Возвращает значение площади квадрата с заданной стороной
#
#   Параметры:
#       a (float): сторона квадрата
#
#   Возвращаемое значение:
#      rectangle_perimeter (float): площадь квадрата со стороной a 
#   ```

    return a * a


def perimeter(a):

#   ```
#   Возвращает значение периметра квадрата с заданными сторонами
#
#   Параметры:
#       a (float): первая сторона
#       b (float): вторая сторона
#
#   Возвращаемое значение:
#      square_perimeter (float): периметр квадрата со сторонами a и b 
#   ```
    return 4 * a
